{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {}
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<bos>": 0,
      "<eos>": 1,
      "<unk>": 2,
      "tok0": 3,
      "tok1": 4,
      "tok2": 5,
      "tok3": 6,
      "tok4": 7,
      "tok5": 8,
      "tok6": 9,
      "tok7": 10,
      "tok8": 11,
      "tok9": 12,
      "tok10": 13,
      "tok11": 14,
      "tok12": 15,
      "tok13": 16,
      "tok14": 17,
      "tok15": 18,
      "tok16": 19,
      "tok17": 20,
      "tok18": 21,
      "tok19": 22,
      "tok20": 23,
      "tok21": 24,
      "tok22": 25,
      "tok23": 26,
      "tok24": 27,
      "tok25": 28,
      "tok26": 29,
      "tok27": 30,
      "tok28": 31,
      "tok29": 32,
      "tok30": 33,
      "tok31": 34,
      "tok32": 35,
      "tok33": 36,
      "tok34": 37,
      "tok35": 38,
      "tok36": 39,
      "tok37": 40,
      "tok38": 41,
      "tok39": 42,
      "tok40": 43,
      "tok41": 44,
      "tok42": 45,
      "tok43": 46,
      "tok44": 47,
      "tok45": 48,
      "tok46": 49,
      "tok47": 50,
      "tok48": 51,
      "tok49": 52,
      "tok50": 53,
      "tok51": 54,
      "tok52": 55,
      "tok53": 56,
      "tok54": 57,
      "tok55": 58,
      "tok56": 59,
      "tok57": 60,
      "tok58": 61,
      "tok59": 62,
      "tok60": 63,
      "tok61": 64,
      "tok62": 65,
      "tok63": 66,
      "tok64": 67,
      "tok65": 68,
      "tok66": 69,
      "tok67": 70,
      "tok68": 71,
      "tok69": 72,
      "tok70": 73,
      "tok71": 74,
      "tok72": 75,
      "tok73": 76,
      "tok74": 77,
      "tok75": 78,
      "tok76": 79,
      "tok77": 80,
      "tok78": 81,
      "tok79": 82,
      "tok80": 83,
      "tok81": 84,
      "tok82": 85,
      "tok83": 86,
      "tok84": 87,
      "tok85": 88,
      "tok86": 89,
      "tok87": 90,
      "tok88": 91,
      "tok89": 92,
      "tok90": 93,
      "tok91": 94,
      "tok92": 95,
      "tok93": 96,
      "tok94": 97,
      "tok95": 98,
      "tok96": 99,
      "tok97": 100,
      "tok98": 101,
      "tok99": 102,
      "tok100": 103,
      "tok101": 104,
      "tok102": 105,
      "tok103": 106,
      "tok104": 107,
      "tok105": 108,
      "tok106": 109,
      "tok107": 110,
      "tok108": 111,
      "tok109": 112,
      "tok110": 113,
      "tok111": 114,
      "tok112": 115,
      "tok113": 116,
      "tok114": 117,
      "tok115": 118,
      "tok116": 119,
      "tok117": 120,
      "tok118": 121,
      "tok119": 122,
      "tok120": 123,
      "tok121": 124,
      "tok122": 125,
      "tok123": 126,
      "tok124": 127
    },
    "unk_token": "<unk>"
  }
}